spc = '''
`-- -- -- -- -- -- -- -- --`
✰` .وعد `
✰` .بوت المليار`
`-- -- -- -- -- -- -- -- --`
'''
spc2 = '''
`-- -- -- -- -- -- -- -- --`
✰` .وعد `
✰` .بوت المليار`
✰` .تشيكر تلي`
`-- -- -- -- -- -- -- -- --`
waad = '''
`-- -- -- -- -- -- -- -- --`
**✰` .استثمار وعد + العدد ` : يستثمر ب وعد تلقائي
✰` .كلمات وعد ` : يلعب كلمات تلقائي**
`-- -- -- -- -- -- -- -- --`
'''
tele_checker = '''
`-- -- -- -- -- -- -- -- --`**
✰` .تثبيت يدوي + القناة + اليوزر ` : يثبت اليوزر بقناة معينة
✰` .كلايم + العدد + النوع + القناة ` :يفحص يوزرات ويثتبها عقناتك
✰` .تثبيت تلقائي + العدد + القناة + اليوزر ` : يثبت اليوزر بقناة معينة
✰` .حالة الكلايم ` : لمعرفة تقدم الكلايم
✰` .حالة التثبيت التلقائي ` : لمعرفة تقدم التثبيت التلقائي
✰` .الانواع ` : لمعرفة انواع اليوزرات
**`-- -- -- -- -- -- -- -- --`
'''
tele_checker2 = '''
الانواع :
1 : سداسي حرفين
2 : شبه ثلاثي
3 : سداسي حرف واحد
4 : يوزر بوت ثلاثي
5 : خماسي حرفين
6 : خماسي حرف
7 : سباعي حرف
مثال : .كلايم 500 4 AAAAA
'''
t06bot = '''
`-- -- -- -- -- -- -- -- --`**
✰` .تجميع المليار ` : يشترك ب قنوات بوت المليار تلقائي
**`-- -- -- -- -- -- -- -- --`
'''
